tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Platform built on V8 to build network applications
brew "node"
# Feature-rich console based todo list manager
brew "task"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Multiplayer online battle arena game
cask "league-of-legends"
# Collaboration platform for API development
cask "postman"
# Music streaming service
cask "spotify"
# Virtualizer for x86 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
